# Leemos datos
 Notebook que lee archivos csv para obtener el dataset

## Definiciones

In [ ]:
# Aqui las definiciones

## Import libraries

In [1]:
# Aqui las librerias importadas
import pandas as pd

## (opcional) Montar drive
Para las primeras actividades usar google Colab para las actividades es opcional. Este codigo esta aqui puesto que luego puede ser util usar el entorno acelerado por GPU de google colab para entrenar los modelos de IA. (Pytorch tiene la opcion de usar CUDA y CUDNN para acelerar el procesamiento con multithreading)

In [ ]:
from google.colab import drive

drive.mount('content/drive')

## Leer datos
Cargar datos del archivo .csv para subirlo

In [ ]:
# En entorno local
file_path = '../../NotebooksProfessor/cartwheel/cartwheel.csv'

In [2]:
df= pd.read_csv(file_path)

Use df atribute .shape that gives the number of rows and columns in the dataset object created through pandas.

index: 0 has rows | index: 1 has columns

In [4]:
# Get number of rows and colums
df.shape

(52, 12)

In [5]:
# Get number of rows
Nrows = df.shape[0]

print('The Number of rows is ' + str(Nrows))

# Get number of cols
Ncols = df.shape[1]

print('The Number of columns is ' + str(Ncols))

The Number of rows is 52
The Number of columns is 12

In [7]:
df.columns

Index(['ID', 'Age', 'Gender', 'GenderGroup', 'Glasses', 'GlassesGroup',
       'Height', 'Wingspan', 'CWDistance', 'Complete', 'CompleteGroup',
       'Score'],
      dtype='object')

In [6]:
#Obtener datos de una columna
df.Age

0     56.0
1     26.0
2     33.0
3     39.0
4     27.0
5     24.0
6     28.0
7     22.0
8     29.0
9     33.0
10    30.0
11    28.0
12    25.0
13    23.0
14    31.0
15    26.0
16    26.0
17    27.0
18    23.0
19    24.0
20    23.0
21    29.0
22    25.0
23    26.0
24    23.0
25    28.0
26    24.0
27    25.0
28    32.0
29    38.0
30    27.0
31    33.0
32    38.0
33    27.0
34    24.0
35    27.0
36    25.0
37    26.0
38    31.0
39    30.0
40    23.0
41    26.0
42    28.0
43    26.0
44    30.0
45    39.0
46    27.0
47    24.0
48    28.0
49    30.0
50     NaN
51    27.0
Name: Age, dtype: float64

In [8]:
#Obtener un subdataframe a partir de un dataframe
df2 = df[['Age','Height','Wingspan','CWDistance']]

In [10]:
#Obtener las 3 primeras filas
df2.head(3)

    Age  Height  Wingspan  CWDistance
0  56.0    62.0      61.0          79
1  26.0    62.0      60.0          70
2  33.0    66.0      64.0          85

In [9]:
#Obtener las ultimas 3 filas del dataframe dado
df2.tail(3)

     Age  Height  Wingspan  CWDistance
49  30.0    74.6       NaN          71
50   NaN    71.0      70.0         101
51  27.0     NaN      71.5         103

In [14]:
df2.mean(0)

Age           28.411765
Height        68.971569
Wingspan      67.313725
CWDistance    85.576923
dtype: float64

In [15]:
df2.describe()

             Age     Height   Wingspan  CWDistance
count  51.000000  51.000000  51.000000   52.000000
mean   28.411765  68.971569  67.313725   85.576923
std     5.755611   5.303812   5.624021   14.353173
min    22.000000  61.500000  57.500000   63.000000
25%    25.000000  64.500000  63.000000   72.000000
50%    27.000000  69.000000  66.000000   85.000000
75%    30.000000  73.000000  72.000000   96.500000
max    56.000000  79.500000  76.000000  115.000000